[Killed] BlockStatement
src/advanced.js:4:22
 
 //Advanced Calculator Function
  
-  function pow(x, n) {
-    return Math.pow(x, n);
-  }
+  function pow(x, n) {}
   
   function modulo(a, b) {
killedBy: Pow returns correct result for positive exponent
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 8
Received: undefined

[Killed] BlockStatement
src/advanced.js:8:25
     return Math.pow(x, n);
   }
   
-  function modulo(a, b) {
-    return a % b;
-  }
+  function modulo(a, b) {}
   
 
killedBy: Modulo returns correct result for positive numbers
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: undefined

[Killed] ArithmeticOperator
src/advanced.js:9:12
   }
   
   function modulo(a, b) {
-    return a % b;
+    return a * b;
   }
   
killedBy: Modulo returns correct result for positive numbers
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 10

[Killed] BlockStatement
src/advanced.js:14:29
   
 
  // Selection Sort Algorithm
-function selectionSort(arr) {
-    const n = arr.length;
-    for (let i = 0; i < n - 1; i++) {
-      let minIndex = i;
-      for (let j = i + 1; j < n; j++) {
-        if (arr[j] < arr[minIndex]) {
-          minIndex = j;
-        }
-      }
-      if (minIndex !== i) {
-        // Swap arr[i] and arr[minIndex]
-        [arr[i], arr[minIndex]] = [arr[minIndex], arr[i]];
-      }
-    }
-    return arr;
-  }
+function selectionSort(arr) {}
   
   // Insertion Sort Algorithm
killedBy: Selection Sort sorts an array in ascending order
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [1, 1, 2, 3, 4, 5, 5, 6, 9]
Received: undefined

[Killed] BlockStatement
src/advanced.js:16:37
  // Selection Sort Algorithm
 function selectionSort(arr) {
     const n = arr.length;
-    for (let i = 0; i < n - 1; i++) {
-      let minIndex = i;
-      for (let j = i + 1; j < n; j++) {
-        if (arr[j] < arr[minIndex]) {
-          minIndex = j;
-        }
-      }
-      if (minIndex !== i) {
-        // Swap arr[i] and arr[minIndex]
-        [arr[i], arr[minIndex]] = [arr[minIndex], arr[i]];
-      }
-    }
+    for (let i = 0; i < n - 1; i++) {}
     return arr;
   }
killedBy: Selection Sort sorts an array in ascending order
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 5

  Array [
-   1,
-   1,

[Killed] ConditionalExpression
src/advanced.js:16:21
  // Selection Sort Algorithm
 function selectionSort(arr) {
     const n = arr.length;
-    for (let i = 0; i < n - 1; i++) {
+    for (let i = 0; false; i++) {
       let minIndex = i;
       for (let j = i + 1; j < n; j++) {
killedBy: Selection Sort sorts an array in ascending order
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 5

  Array [
-   1,
-   1,

[Killed] EqualityOperator
src/advanced.js:18:27
     const n = arr.length;
     for (let i = 0; i < n - 1; i++) {
       let minIndex = i;
-      for (let j = i + 1; j < n; j++) {
+      for (let j = i + 1; j >= n; j++) {
         if (arr[j] < arr[minIndex]) {
           minIndex = j;
killedBy: Selection Sort sorts an array in ascending order
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 5

  Array [
-   1,
-   1,

[Killed] ArithmeticOperator
src/advanced.js:18:20
     const n = arr.length;
     for (let i = 0; i < n - 1; i++) {
       let minIndex = i;
-      for (let j = i + 1; j < n; j++) {
+      for (let j = i - 1; j < n; j++) {
         if (arr[j] < arr[minIndex]) {
           minIndex = j;
killedBy: Selection Sort sorts an array in ascending order
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 5

  Array [
-   1,
-   1,

[Killed] ConditionalExpression
src/advanced.js:19:13
     for (let i = 0; i < n - 1; i++) {
       let minIndex = i;
       for (let j = i + 1; j < n; j++) {
-        if (arr[j] < arr[minIndex]) {
+        if (false) {
           minIndex = j;
         }
killedBy: Selection Sort sorts an array in ascending order
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 5

  Array [
-   1,
-   1,

[Killed] ConditionalExpression
src/advanced.js:19:13
     for (let i = 0; i < n - 1; i++) {
       let minIndex = i;
       for (let j = i + 1; j < n; j++) {
-        if (arr[j] < arr[minIndex]) {
+        if (true) {
           minIndex = j;
         }
killedBy: Selection Sort sorts an array in ascending order
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 5

  Array [
-   1,
-   1,

[Killed] BlockStatement
src/advanced.js:23:27
           minIndex = j;
         }
       }
-      if (minIndex !== i) {
-        // Swap arr[i] and arr[minIndex]
-        [arr[i], arr[minIndex]] = [arr[minIndex], arr[i]];
-      }
+      if (minIndex !== i) {}
     }
     return arr;
killedBy: Selection Sort sorts an array in ascending order
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 5

  Array [
-   1,
-   1,

[Killed] EqualityOperator
src/advanced.js:23:11
           minIndex = j;
         }
       }
-      if (minIndex !== i) {
+      if (minIndex === i) {
         // Swap arr[i] and arr[minIndex]
         [arr[i], arr[minIndex]] = [arr[minIndex], arr[i]];
killedBy: Selection Sort sorts an array in ascending order
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 5

  Array [
-   1,
-   1,

[Killed] ArrayDeclaration
src/advanced.js:25:35
       }
       if (minIndex !== i) {
         // Swap arr[i] and arr[minIndex]
-        [arr[i], arr[minIndex]] = [arr[minIndex], arr[i]];
+        [arr[i], arr[minIndex]] = [];
       }
     }
killedBy: Selection Sort sorts an array in ascending order
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 8
+ Received  + 8

  Array [
-   1,
-   1,

[Killed] BlockStatement
src/advanced.js:32:31
   }
   
   // Insertion Sort Algorithm
-  function insertionSort(arr) {
-    const n = arr.length;
-    for (let i = 1; i < n; i++) {
-      let current = arr[i];
-      let j = i - 1;
-      while (j >= 0 && arr[j] > current) {
-        arr[j + 1] = arr[j];
-        j--;
-      }
-      arr[j + 1] = current;
-    }
-    return arr;
-  }
+  function insertionSort(arr) {}
   
   
killedBy: Insertion Sort sorts an array in ascending order
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [1, 1, 2, 3, 4, 5, 5, 6, 9]
Received: undefined

[Killed] ConditionalExpression
src/advanced.js:34:21
   // Insertion Sort Algorithm
   function insertionSort(arr) {
     const n = arr.length;
-    for (let i = 1; i < n; i++) {
+    for (let i = 1; false; i++) {
       let current = arr[i];
       let j = i - 1;
killedBy: Insertion Sort sorts an array in ascending order
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 5

  Array [
-   1,
-   1,

[Killed] BlockStatement
src/advanced.js:34:33
   // Insertion Sort Algorithm
   function insertionSort(arr) {
     const n = arr.length;
-    for (let i = 1; i < n; i++) {
-      let current = arr[i];
-      let j = i - 1;
-      while (j >= 0 && arr[j] > current) {
-        arr[j + 1] = arr[j];
-        j--;
-      }
-      arr[j + 1] = current;
-    }
+    for (let i = 1; i < n; i++) {}
     return arr;
   }
killedBy: Insertion Sort sorts an array in ascending order
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 5

  Array [
-   1,
-   1,

[Killed] ArithmeticOperator
src/advanced.js:36:15
     const n = arr.length;
     for (let i = 1; i < n; i++) {
       let current = arr[i];
-      let j = i - 1;
+      let j = i + 1;
       while (j >= 0 && arr[j] > current) {
         arr[j + 1] = arr[j];
killedBy: Insertion Sort sorts an array in ascending order
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 8

  Array [
+   3,
+   1,

[Killed] EqualityOperator
src/advanced.js:37:14
     for (let i = 1; i < n; i++) {
       let current = arr[i];
       let j = i - 1;
-      while (j >= 0 && arr[j] > current) {
+      while (j < 0 && arr[j] > current) {
         arr[j + 1] = arr[j];
         j--;
killedBy: Insertion Sort sorts an array in ascending order
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 5

  Array [
-   1,
-   1,

[Killed] ConditionalExpression
src/advanced.js:37:24
     for (let i = 1; i < n; i++) {
       let current = arr[i];
       let j = i - 1;
-      while (j >= 0 && arr[j] > current) {
+      while (j >= 0 && true) {
         arr[j + 1] = arr[j];
         j--;
killedBy: Insertion Sort sorts an array in ascending order
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 6

  Array [
-   1,
-   1,

[Killed] ArithmeticOperator
src/advanced.js:38:13
       let current = arr[i];
       let j = i - 1;
       while (j >= 0 && arr[j] > current) {
-        arr[j + 1] = arr[j];
+        arr[j - 1] = arr[j];
         j--;
       }
killedBy: Insertion Sort sorts an array in ascending order
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 7
+ Received  + 7

  Array [
-   1,
-   1,

[Timeout] UpdateOperator
src/advanced.js:39:9
       let j = i - 1;
       while (j >= 0 && arr[j] > current) {
         arr[j + 1] = arr[j];
-        j--;
+        j++;
       }
       arr[j + 1] = current;

[Killed] ArithmeticOperator
src/advanced.js:41:11
         arr[j + 1] = arr[j];
         j--;
       }
-      arr[j + 1] = current;
+      arr[j - 1] = current;
     }
     return arr;
killedBy: Insertion Sort sorts an array in ascending order
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 5

  Array [
-   1,
-   1,
