[Killed] BlockStatement
src/converter.js:1:44
-function WeightConverter(measurement, val) {
-    var result1, result2;
-
-    if (measurement === "ounces") {
-        result1 = (val / 16).toFixed(2) + " pounds";
-        result2 = (val / 32000).toFixed(2) + " tons";
-    } else if (measurement === "pounds") {
-        result1 = (val * 16).toFixed(2) + " ounces";
-        result2 = (val / 2000).toFixed(2) + " tons";
-    } else if (measurement === "tons") {
-        result1 = (val * 2000).toFixed(2) + " pounds";
-        result2 = (val * 32000).toFixed(2) + " ounces";
-    } else {
-        return "wrong input";
-    }
-    return [result1, result2];
-}
+function WeightConverter(measurement, val) {}
 
 module.exports = {
killedBy: WeightConverter should convert ounces to pounds and tons
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: ["1.00 pounds", "0.00 tons"]
Received: undefined

[Killed] EqualityOperator
src/converter.js:4:9
 function WeightConverter(measurement, val) {
     var result1, result2;
 
-    if (measurement === "ounces") {
+    if (measurement !== "ounces") {
         result1 = (val / 16).toFixed(2) + " pounds";
         result2 = (val / 32000).toFixed(2) + " tons";
killedBy: WeightConverter should convert ounces to pounds and tons
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: ["1.00 pounds", "0.00 tons"]
Received: "wrong input"

[Killed] ConditionalExpression
src/converter.js:4:9
 function WeightConverter(measurement, val) {
     var result1, result2;
 
-    if (measurement === "ounces") {
+    if (false) {
         result1 = (val / 16).toFixed(2) + " pounds";
         result2 = (val / 32000).toFixed(2) + " tons";
killedBy: WeightConverter should convert ounces to pounds and tons
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: ["1.00 pounds", "0.00 tons"]
Received: "wrong input"

[Killed] ArithmeticOperator
src/converter.js:5:20
     var result1, result2;
 
     if (measurement === "ounces") {
-        result1 = (val / 16).toFixed(2) + " pounds";
+        result1 = (val * 16).toFixed(2) + " pounds";
         result2 = (val / 32000).toFixed(2) + " tons";
     } else if (measurement === "pounds") {
killedBy: WeightConverter should convert ounces to pounds and tons
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "1.00 pounds",
+   "256.00 pounds",

[Killed] StringLiteral
src/converter.js:8:43
         result1 = (val / 16).toFixed(2) + " pounds";
         result2 = (val / 32000).toFixed(2) + " tons";
     } else if (measurement === "pounds") {
-        result1 = (val * 16).toFixed(2) + " ounces";
+        result1 = (val * 16).toFixed(2) + "";
         result2 = (val / 2000).toFixed(2) + " tons";
     } else if (measurement === "tons") {
killedBy: WeightConverter should convert pounds to ounces and tons
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "32.00 ounces",
+   "32.00",

[Killed] BlockStatement
src/converter.js:10:40
     } else if (measurement === "pounds") {
         result1 = (val * 16).toFixed(2) + " ounces";
         result2 = (val / 2000).toFixed(2) + " tons";
-    } else if (measurement === "tons") {
-        result1 = (val * 2000).toFixed(2) + " pounds";
-        result2 = (val * 32000).toFixed(2) + " ounces";
-    } else {
+    } else if (measurement === "tons") {} else {
         return "wrong input";
     }
killedBy: WeightConverter should convert tons to pounds and ounces
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   "2000.00 pounds",
-   "32000.00 ounces",

[Killed] ObjectLiteral
src/converter.js:19:18
     return [result1, result2];
 }
 
-module.exports = {
-    WeightConverter
-};
+module.exports = {};
 
killedBy: WeightConverter should convert ounces to pounds and tons
statusReason: TypeError: WeightConverter is not a function
