[Killed] BlockStatement
src/isPalindrome.js:1:31
-function isPalindrome(number) {
-    let original = number;
-    let reminder, reversed = 0;
-    while(number >= 1) {
-        reminder = parseInt(number%10);
-        reversed = reversed*10 + reminder;
-        number = parseInt(number / 10);
-    }
-    if(original == reversed) return true;
-    return false;
-}
+function isPalindrome(number) {}
 console.log(isPalindrome(1213))
 module.exports = {
killedBy: isPalindrome should return true for palindromic numbers
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] EqualityOperator
src/isPalindrome.js:4:11
 function isPalindrome(number) {
     let original = number;
     let reminder, reversed = 0;
-    while(number >= 1) {
+    while(number > 1) {
         reminder = parseInt(number%10);
         reversed = reversed*10 + reminder;
killedBy: isPalindrome should return true for palindromic numbers
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/isPalindrome.js:4:11
 function isPalindrome(number) {
     let original = number;
     let reminder, reversed = 0;
-    while(number >= 1) {
+    while(false) {
         reminder = parseInt(number%10);
         reversed = reversed*10 + reminder;
killedBy: isPalindrome should return true for palindromic numbers
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ArithmeticOperator
src/isPalindrome.js:5:29
     let original = number;
     let reminder, reversed = 0;
     while(number >= 1) {
-        reminder = parseInt(number%10);
+        reminder = parseInt(number * 10);
         reversed = reversed*10 + reminder;
         number = parseInt(number / 10);
killedBy: isPalindrome should return true for palindromic numbers
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ArithmeticOperator
src/isPalindrome.js:6:20
     let reminder, reversed = 0;
     while(number >= 1) {
         reminder = parseInt(number%10);
-        reversed = reversed*10 + reminder;
+        reversed = reversed * 10 - reminder;
         number = parseInt(number / 10);
     }
killedBy: isPalindrome should return true for palindromic numbers
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ArithmeticOperator
src/isPalindrome.js:6:20
     let reminder, reversed = 0;
     while(number >= 1) {
         reminder = parseInt(number%10);
-        reversed = reversed*10 + reminder;
+        reversed = reversed / 10 + reminder;
         number = parseInt(number / 10);
     }
killedBy: isPalindrome should return true for palindromic numbers
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Timeout] ArithmeticOperator
src/isPalindrome.js:7:27
     while(number >= 1) {
         reminder = parseInt(number%10);
         reversed = reversed*10 + reminder;
-        number = parseInt(number / 10);
+        number = parseInt(number * 10);
     }
     if(original == reversed) return true;

[Killed] ConditionalExpression
src/isPalindrome.js:9:8
         reversed = reversed*10 + reminder;
         number = parseInt(number / 10);
     }
-    if(original == reversed) return true;
+    if(false) return true;
     return false;
 }
killedBy: isPalindrome should return true for palindromic numbers
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
src/isPalindrome.js:9:8
         reversed = reversed*10 + reminder;
         number = parseInt(number / 10);
     }
-    if(original == reversed) return true;
+    if(original != reversed) return true;
     return false;
 }
killedBy: isPalindrome should return true for palindromic numbers
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
src/isPalindrome.js:10:12
         number = parseInt(number / 10);
     }
     if(original == reversed) return true;
-    return false;
+    return true;
 }
 console.log(isPalindrome(1213))
killedBy: isPalindrome should return false for non-palindromic numbers
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true
