[Killed] BlockStatement
src/basic.js:2:20
 // Addition
-function add(a, b) {
-    return a + b;
-}
+function add(a, b) {}
 
 // Subtraction
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: undefined

[Killed] BlockStatement
src/basic.js:7:25
 }
 
 // Subtraction
-function subtract(a, b) {
-    return a - b;
-}
+function subtract(a, b) {}
 
 // Multiplication
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: undefined

[Killed] BlockStatement
src/basic.js:12:25
 }
 
 // Multiplication
-function multiply(a, b) {
-    return a * b;
-}
+function multiply(a, b) {}
 
 // Division
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: undefined

[Killed] BlockStatement
src/basic.js:17:23
 }
 
 // Division
-function divide(a, b) {
-        return a / b;
-    
-}
+function divide(a, b) {}
 
 module.exports = {
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: undefined
