[Killed] BlockStatement
src/mergeSort.js:1:29
-function merge(left, right) {
-    let sortedArr = [] 
-    while (left.length && right.length) {
-      if (left[0] < right[0]) {
-        sortedArr.push(left.shift())
-      } else {
-        sortedArr.push(right.shift())
-      }
-    }
-    return [...sortedArr, ...left, ...right]
-}
+function merge(left, right) {}
 function mergeSort(arr) {
     if (arr.length <= 1) return arr
killedBy: mergeSort should correctly sort an array
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [1, 3, 5, 5, 8, 99]
Received: undefined

[Killed] ArrayDeclaration
src/mergeSort.js:2:21
 function merge(left, right) {
-    let sortedArr = [] 
+    let sortedArr = ["Stryker was here"] 
     while (left.length && right.length) {
       if (left[0] < right[0]) {
killedBy: mergeSort should correctly sort an array
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 7

  Array [
+   "Stryker was here",
+   "Stryker was here",

[Killed] ConditionalExpression
src/mergeSort.js:3:12
 function merge(left, right) {
     let sortedArr = [] 
-    while (left.length && right.length) {
+    while (false) {
       if (left[0] < right[0]) {
         sortedArr.push(left.shift())
killedBy: mergeSort should correctly sort an array
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   1,
    3,

[Timeout] LogicalOperator
src/mergeSort.js:3:12
 function merge(left, right) {
     let sortedArr = [] 
-    while (left.length && right.length) {
+    while (left.length || right.length) {
       if (left[0] < right[0]) {
         sortedArr.push(left.shift())

[Killed] ConditionalExpression
src/mergeSort.js:4:11
 function merge(left, right) {
     let sortedArr = [] 
     while (left.length && right.length) {
-      if (left[0] < right[0]) {
+      if (true) {
         sortedArr.push(left.shift())
       } else {
killedBy: mergeSort should correctly sort an array
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   1,
    3,

[Killed] ConditionalExpression
src/mergeSort.js:4:11
 function merge(left, right) {
     let sortedArr = [] 
     while (left.length && right.length) {
-      if (left[0] < right[0]) {
+      if (false) {
         sortedArr.push(left.shift())
       } else {
killedBy: mergeSort should correctly sort an array
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
    1,
-   3,

[Timeout] BlockStatement
src/mergeSort.js:6:14
     while (left.length && right.length) {
       if (left[0] < right[0]) {
         sortedArr.push(left.shift())
-      } else {
-        sortedArr.push(right.shift())
-      }
+      } else {}
     }
     return [...sortedArr, ...left, ...right]

[Killed] BlockStatement
src/mergeSort.js:12:25
     }
     return [...sortedArr, ...left, ...right]
 }
-function mergeSort(arr) {
-    if (arr.length <= 1) return arr
-    let mid = Math.floor(arr.length / 2)
-    let left = mergeSort(arr.slice(0, mid))
-    let right = mergeSort(arr.slice(mid))
-    return merge(left, right)
-}
+function mergeSort(arr) {}
 console.log(mergeSort([3, 5, 8, 5, 99, 1]))
 module.exports = {
killedBy: mergeSort should correctly sort an array
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [1, 3, 5, 5, 8, 99]
Received: undefined

[Killed] ConditionalExpression
src/mergeSort.js:13:9
     return [...sortedArr, ...left, ...right]
 }
 function mergeSort(arr) {
-    if (arr.length <= 1) return arr
+    if (true) return arr
     let mid = Math.floor(arr.length / 2)
     let left = mergeSort(arr.slice(0, mid))
killedBy: mergeSort should correctly sort an array
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   1,
    3,

[Killed] EqualityOperator
src/mergeSort.js:13:9
     return [...sortedArr, ...left, ...right]
 }
 function mergeSort(arr) {
-    if (arr.length <= 1) return arr
+    if (arr.length > 1) return arr
     let mid = Math.floor(arr.length / 2)
     let left = mergeSort(arr.slice(0, mid))
killedBy: mergeSort should correctly sort an array
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   1,
    3,
